In [1]:
import pandas as pd
import numpy as np
import datetime

###### Generate two $3*4$ DataFrames, one $6*2$ and one Series with random numbers and one dataframe from a dictionary

In [2]:
df_1 = pd.DataFrame( np.random.uniform( 0 , 10 , [3 , 4] ),
                    columns=['a','b','c','d'],
                    index=['x0','x1','x2'])


df_2 = pd.DataFrame( np.random.uniform( 0 , 10 , [3 , 4] )
                    )
df_2.index=['x3','x4','x5']
df_2.columns=['a','b','c','d']


df_3 = pd.DataFrame( np.random.uniform( 0 , 10 , [6 , 2] ),
                    columns=['e','f'],
                    index=['y%s'%i for i in range(6)])

df_4 = pd.DataFrame.from_dict( {
    "Mostafa":{"Age":32,"GPA":4, "books":100},
    "Ali":{"Age":33,"GPA":3.9, "books":120},
    "Vahid":{"Age":34,"GPA":3.8, "books":90},
} , orient='index' )


se_1 = pd.Series( np.random.uniform( 0 , 10 , [6 , ] ) 
                 , index=['s%s'%i for i in range(6)] )


print(df_1)
print(df_2)
print(df_3)
print(df_4)
print(se_1)
print(df_1.columns)
print(df_1.index)

           a         b         c         d
x0  3.538400  8.743199  5.830713  7.451853
x1  9.632388  6.663570  7.307915  9.808764
x2  3.636787  4.060684  9.001412  1.199779
           a         b         c         d
x3  9.739215  0.328173  7.335577  6.951243
x4  0.676435  7.566196  0.372750  3.195407
x5  7.195362  3.383471  9.952436  6.611732
           e         f
y0  6.696389  0.352782
y1  8.600039  6.899660
y2  1.688944  4.403623
y3  1.354091  7.416735
y4  5.772598  1.601258
y5  3.868546  5.655531
         Age  GPA  books
Ali       33  3.9    120
Mostafa   32  4.0    100
Vahid     34  3.8     90
s0    5.368727
s1    4.755762
s2    7.264091
s3    5.868950
s4    3.438957
s5    5.380591
dtype: float64
Index(['a', 'b', 'c', 'd'], dtype='object')
Index(['x0', 'x1', 'x2'], dtype='object')

#### data indexing

In [3]:
print(df_4.loc['Mostafa'])

Age       32.0
GPA        4.0
books    100.0
Name: Mostafa, dtype: float64

In [4]:
print(df_4.iloc[1])

Age       32.0
GPA        4.0
books    100.0
Name: Mostafa, dtype: float64

In [5]:
print(df_4['GPA'])

Ali        3.9
Mostafa    4.0
Vahid      3.8
Name: GPA, dtype: float64

In [6]:
print( df_4['GPA']['Ali'] )

3.9

#### reindexing and filling

In [7]:
se_2 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
se_2

0      blue
2    purple
4    yellow
dtype: object

In [8]:
se_2.reindex(range(6))

0      blue
1       NaN
2    purple
3       NaN
4    yellow
5       NaN
dtype: object

In [9]:
se_2.reindex(range(6), fill_value='red')

0      blue
1       red
2    purple
3       red
4    yellow
5       red
dtype: object

In [10]:
se_2.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [11]:
se_3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 3, 4])
se_3

0      blue
3    purple
4    yellow
dtype: object

In [12]:
print( se_3.reindex(range(6), method='ffill', limit=1))

0      blue
1      blue
2       NaN
3    purple
4    yellow
5    yellow
dtype: object

In [13]:
print(df_4)
print(df_4.reindex(['Ali','Mostafa','Hesam','Vahid']))
print(df_4.reindex( columns= ['GPA','Age','books']))
print(df_4.reindex(['Mostafa','Ali','Vahid']))

         Age  GPA  books
Ali       33  3.9    120
Mostafa   32  4.0    100
Vahid     34  3.8     90
          Age  GPA  books
Ali      33.0  3.9  120.0
Mostafa  32.0  4.0  100.0
Hesam     NaN  NaN    NaN
Vahid    34.0  3.8   90.0
         GPA  Age  books
Ali      3.9   33    120
Mostafa  4.0   32    100
Vahid    3.8   34     90
         Age  GPA  books
Mostafa   32  4.0    100
Ali       33  3.9    120
Vahid     34  3.8     90

#### Arithmetic

In [14]:
df_5 = pd.DataFrame( np.random.uniform( 0 , 10 , [3 , 4] ),
                    columns=['a','b','c','d'],
                    index=['x0','x1','x2'])
df_6 = pd.DataFrame( np.random.uniform( 0 , 10 , [3 , 5] ),
                    columns=['a','b','c','d','e'],
                    index=['x0','x1','x2'])

In [15]:
print(df_5)
print(df_6)
print(df_5 + df_6)
print(df_5.add(df_6, fill_value=0) )  #### try sub, div, mul

           a         b         c         d
x0  7.062779  9.469355  5.273375  1.527075
x1  3.793528  2.722458  1.982219  6.163314
x2  5.414560  9.604012  3.797846  8.938018
           a         b         c         d         e
x0  4.607539  2.458299  9.128419  7.478657  1.843160
x1  9.085608  3.165846  0.368001  8.286491  7.230939
x2  6.288949  4.976880  1.375797  7.076689  4.015486
            a          b          c          d   e
x0  11.670318  11.927654  14.401794   9.005732 NaN
x1  12.879136   5.888304   2.350220  14.449805 NaN
x2  11.703510  14.580892   5.173643  16.014708 NaN
            a          b          c          d         e
x0  11.670318  11.927654  14.401794   9.005732  1.843160
x1  12.879136   5.888304   2.350220  14.449805  7.230939
x2  11.703510  14.580892   5.173643  16.014708  4.015486

#### Operations between DataFrame and Series

In [16]:
df_7 = pd.DataFrame( np.array(range(9)).reshape(3,3) ,
                    columns=['a','b','c'])
se_4 = pd.Series([1, 2, 3], index=['a','b','c'])
se_5 = pd.Series([1, 2, 3], index=[0,1,2])

print(df_7)
print(se_4)
print(se_5)

print( df_7.sub( se_5 , axis=0) )
print( df_7.sub( se_4 , axis=1) )

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8
a    1
b    2
c    3
dtype: int64
0    1
1    2
2    3
dtype: int64
   a  b  c
0 -1  0  1
1  1  2  3
2  3  4  5
   a  b  c
0 -1 -1 -1
1  2  2  2
2  5  5  5

#### Sorting and ranking

In [20]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [21]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [23]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'], columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [25]:
frame.sort_index(axis=1,ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

### Summarizing and Computing Descriptive Statistics

In [27]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]],
index=['a', 'b', 'c', 'd'], columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [33]:
df.sum()
# df.mean()
df.cumsum() #cumulative sum of columns
# cumprod
# pct_change

# median, 
# min, max, argmin, argmax, idxmin, idxmax

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [29]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [30]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [36]:
# column with max sum
df[df.sum().idxmax()]

a    1.40
b    7.10
c     NaN
d    0.75
Name: one, dtype: float64

In [37]:
### shows summary of statistics
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [38]:
df.quantile()
# var, std, skew, kurt

one    1.4
two   -2.9
Name: 0.5, dtype: float64

### Correlation and Covariance

### Unique Values, Value Counts, and Membership

In [40]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [41]:
obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [42]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [44]:
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [45]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

### Handling Missing Values

### Hierarchical Indexing

In [48]:
data = pd.Series(np.random.randn(10),
                 index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                        [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
data

a  1    1.596285
   2   -0.024036
   3   -1.791024
b  1   -0.637376
   2    1.150919
   3   -1.220503
c  1    1.469933
   2    0.681206
d  2    0.423881
   3    0.411568
dtype: float64

In [52]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [53]:
data.unstack()

          1         2         3
a  1.596285 -0.024036 -1.791024
b -0.637376  1.150919 -1.220503
c  1.469933  0.681206       NaN
d       NaN  0.423881  0.411568

In [54]:
type(data.unstack())

pandas.core.frame.DataFrame

In [55]:
data.unstack().stack()

a  1    1.596285
   2   -0.024036
   3   -1.791024
b  1   -0.637376
   2    1.150919
   3   -1.220503
c  1    1.469933
   2    0.681206
d  2    0.423881
   3    0.411568
dtype: float64

In [59]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3))
                  ,index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]]
                  ,columns=[['Ohio', 'Ohio', 'Colorado']
                  ,['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [61]:
frame.index.names = ['key1', 'key2']
frame

           Ohio     Colorado
          Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [62]:
frame.swaplevel('key1', 'key2')

           Ohio     Colorado
          Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [63]:
#### Summary Statistics by Level
frame.sum(level='key2')

      Ohio     Colorado
     Green Red    Green
key2
1        6   8       10
2       12  14       16

In [66]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1)
                   ,'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two']
                   ,'d': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [68]:
frame.set_index(['c','d'])

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [70]:
frame2 = frame.set_index(['c','d'])
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

### Database-style DataFrame Merges

In [71]:
s1 = pd.Series([0, 1], index=['a', 'b'])
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = pd.Series([5, 6], index=['f', 'g'])

In [72]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [74]:
result = pd.concat([s1, s1, s3], keys=['one', 'two', 'three'])
result

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

In [75]:
result.unstack()

         a    b    f    g
one    0.0  1.0  NaN  NaN
two    0.0  1.0  NaN  NaN
three  NaN  NaN  5.0  6.0

In [77]:
a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan], index=['f', 'e', 'd', 'c', 'b', 'a'])
a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [79]:
b = pd.Series(np.arange(len(a), dtype=np.float64), index=['f', 'e', 'd', 'c', 'b', 'a'])
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [81]:
a.combine_first(b)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64

### Reshape and Pivot

### Using Map

In [8]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami',
                              'corned beef', 'Bacon', 'pastrami', 'honey ham','nova lox']
                     ,'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [9]:
meat_to_animal = { 'bacon': 'pig', 'pulled pork': 'pig', 'pastrami': 'cow',
                  'corned beef': 'cow', 'honey ham': 'pig', 'nova lox': 'salmon'
}

In [11]:
data['food'].map(meat_to_animal)

0       pig
1       pig
2       pig
3       NaN
4       cow
5       NaN
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [13]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [14]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [15]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [16]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## Data Aggregation and Group

In [17]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)
                  })
df

      data1     data2 key1 key2
0  0.297143  1.608176    a  one
1  0.462132 -0.626027    a  two
2 -0.773603  0.470669    b  one
3  1.191221 -0.875083    b  two
4 -0.092299  1.123175    a  one

In [18]:
df['data1'].groupby(df['key1']).mean()

key1
a    0.222325
b    0.208809
Name: data1, dtype: float64

In [21]:
df['data1'].groupby([df['key1'], df['key2']]).mean()

key1  key2
a     one     0.102422
      two     0.462132
b     one    -0.773603
      two     1.191221
Name: data1, dtype: float64

In [26]:
df.groupby(['key1', 'key2'])['data1'].mean()

key1  key2
a     one     0.102422
      two     0.462132
b     one    -0.773603
      two     1.191221
Name: data1, dtype: float64

In [38]:
df.groupby(['key1', 'key2'])['data1'].mean().add_prefix('mean_').unstack()

key2    mean_one  mean_two
key1
mean_a  0.102422  0.462132
mean_b -0.773603  1.191221

In [36]:
df.groupby( ['key1', 'key2'], as_index=False)['data1'].mean()

  key1 key2     data1
0    a  one  0.102422
1    a  two  0.462132
2    b  one -0.773603
3    b  two  1.191221

In [35]:
df.groupby(['key1', 'key2'])['data1'].apply(list)

key1  key2
a     one     [0.2971429351675109, -0.09229912978386857]
      two                           [0.4621324469038638]
b     one                          [-0.7736032389277787]
      two                           [1.1912209781701752]
dtype: object

#### Aggregation

In [33]:
df.agg(['mean', 'std'])

         data1     data2
mean  0.216919  0.340182
std   0.723288  1.078001

In [ ]:
df.agg(['mean', 'std'])

In [34]:
df.agg(['mean', 'std']).idxmax()

data1    std
data2    std
dtype: object

# Time Series

In [45]:
now = datetime.datetime.now()

In [48]:
now

datetime.datetime(2018, 10, 14, 21, 4, 9, 515527)

In [47]:
now.year, now.month,now.day, now.hour, n

(2018, 10, 14, 21)

In [53]:
now + datetime.timedelta(minutes=12)

datetime.datetime(2018, 10, 14, 21, 16, 9, 515527)

#### Converting between string and datetime

In [4]:
stamp = datetime.datetime(2011, 1, 3)
stamp

datetime.datetime(2011, 1, 3, 0, 0)

In [5]:
stamp.strftime('%Y-%m-%d')

'2011-01-03'

In [7]:
# datetime.strptime is the best way to parse a date with a known format.
datetime.datetime.strptime('2011-01-03', '%Y-%m-%d')

datetime.datetime(2011, 1, 3, 0, 0)

In [8]:
# if we do not want to use the format
from dateutil.parser import parse
parse('2011-01-03')

datetime.datetime(2011, 1, 3, 0, 0)

In [9]:
parse('Jan 31, 1997 10:45 PM')

datetime.datetime(1997, 1, 31, 22, 45)

In [10]:
parse('6/12/2011', dayfirst=True)

datetime.datetime(2011, 12, 6, 0, 0)

In [ ]:
def myfunc(x,y):
    return [x/y , x+1]

In [ ]:
# you can write it simppler but just to show you how to do it
df_1[["var1", "var2"]]=df_1[["books","Age"]].apply(lambda x: myfunc(*x), axis=1)

In [ ]:
df_1

In [ ]:
## change values of specific cell
## filter datetime values